<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>Pr&eacute;sentation du cahier de textes</title>
<style type="text/css">
<!--
.Style1 {
	font-size: 12px;
	font-family: Arial, Helvetica, sans-serif;
}
.Style2 {font-size: 12px}
.Style3 {font-family: Arial, Helvetica, sans-serif}
.Style4 {
	font-size: 12px;
	font-family: Arial, Helvetica, sans-serif;
	color: #000000;
	font-weight: bold;
}
.Style6 {font-size: 12px; font-family: Arial, Helvetica, sans-serif; color: #FF0000; }
.Style7 {font-size: 12px; font-family: Arial, Helvetica, sans-serif; color: #FF0000; font-weight: bold; }
.Style8 {
	font-size: 12px;
	font-family: Arial, Helvetica, sans-serif;
	color: #0000FF;
	font-weight: bold;
}
.Style9 {font-size: 12px; font-family: Arial, Helvetica, sans-serif; font-weight: bold; }
.Style10 {font-family: Arial, Helvetica, sans-serif; color: #0000FF; font-size: 12px;}
-->
</style>
</head>

<body>
<p class="Style4">Cahier de textes en quelques mots </p>
<p class="Style1"><em>Cahier de textes</em> permet de mettre &agrave;  disposition des enseignants  et de leurs &eacute;l&egrave;ves un cahier  de textes en intranet ou sur Internet. Son int&eacute;r&ecirc;t&nbsp;? <strong>Son extr&ecirc;me  simplicit&eacute;&nbsp;!</strong></p>
<p class="Style1"><em>Cahier de textes</em> permet la saisie  en ligne du cahier de textes pour un ou plusieurs enseignants d&rsquo;un  &eacute;tablissement scolaire depuis n&rsquo;importe quel poste du r&eacute;seau  &eacute;tablissement ou de leur domicile s&rsquo;ils disposent d&rsquo;une connexion  Internet. L&rsquo;&eacute;l&egrave;ve peut consulter le cahier sur r&eacute;seau &eacute;tablissement ou  depuis son domicile s&rsquo;il dispose d&rsquo;une connexion Internet.</p>
<p class="Style1">&nbsp;</p>
<p class="Style9">Principales fonctionnalit&eacute;s : </p>
<blockquote>
  <p class="Style1"> * Utilisation tr&egrave;s simple pour des enseignants d&eacute;butants en informatique.<br />
    * Aucune formation pr&eacute;voir ;)<br />
    * Possibilit&eacute;s de joindre des fichiers tels que le textes du devoir.<br />
    * Fiche annuelle de progression<br />
    * Module Vie scolaire permettant de diffuser un message via le cahier de textes<br />
    * Module Responsable Etablissement permettant un suivi des cahiers<br />
    * Editeur Latex pour les scientifiques<br />
    * Fil RSS pour le travail &agrave; faire des &eacute;l&egrave;ves<br />
    * Prise en compte des heures suppl&eacute;mentaires<br />
    * Module de d&eacute;claration d'absence int&eacute;gr&eacute;<br />
    * Module Invit&eacute; / Acc&egrave;s inspecteur
    - Conseiller p&eacute;dagogique <br />
    * Existence d&rsquo;un plugin LCS <br />
    * et beaucoup d&rsquo;autres choses encore.... </p>
  <p class="Style1"><a href="http://www.etab.ac-caen.fr/bsauveur/cahier_de_texte/aide/aide.htm">Consultez cette petite animation... </a></p>
  <p class="Style1">&nbsp;</p>
</blockquote>
<p class="Style9">3 niveaux d&rsquo;utilisation : Administrateur - Enseignant - El&egrave;ve</p>
<p class="Style1"><a href="http://www.etab.ac-caen.fr/bsauveur/cahier_de_texte/?page_id=33">Tester en ligne le mode el&egrave;ve - Choisir Terminale A - Economie ou Bureautique</a></p>
<p class="Style1"><a href="http://www.etab.ac-caen.fr/bsauveur/cahier_de_texte/?page_id=33">Autre test en Ter Pro C Sciences physiques par exemple</a></p>
<p class="Style9">Administrateur : - Installation</p>
<p class="Style1">Le cahier de textes est h&eacute;berg&eacute; sur un serveur (supportant le PHP et utilise une base MySql). Vous pouvez ainsi utiliser le serveur propos&eacute; dans le Kit EasyPhp ou utiliser un h&eacute;bergement classique type Free, ou serveur acad&eacute;mique.</p>
<p class="Style1">En clair pour les d&eacute;butants, cette application s&rsquo;installe tr&egrave;s facilement sur un serveur Web . Ce peut &ecirc;tre celui qui h&eacute;berge votre intranet d&rsquo;&eacute;tablissement. Consultez votre administrateur r&eacute;seau. Si rien n&rsquo;existe, il peut mettre gratuitement en route un serveur Apache localement dans l'&eacute;tablissement en installant EasyPhp. Mais dans ce cas, vous et vos &eacute;l&egrave;ves ne pourrez pas remplir ou consulter le cahier de textes depuis votre domicile. Ce peut &ecirc;tre &eacute;galement le serveur acad&eacute;mique h&eacute;bergeant votre site d&rsquo;&eacute;tablissement ou tout autre h&eacute;bergeur tel que Free, OVH&hellip; chez qui vous h&eacute;bergez d&eacute;j&agrave; un site web. Cet h&eacute;bergeur doit vous offrir avec l&rsquo;espace disque un acc&egrave;s &agrave; une base de donn&eacute;es type MySql et supporter le langage PHP.</p>
<p class="Style1">Vous t&eacute;l&eacute;chargez l&rsquo;application et d&eacute;compressez l&rsquo;archive.Vous copiez l&rsquo;application sur le serveur. Vous ex&eacute;cutez le fichier d&rsquo;installation http://nom_serveur/cahier_de_texte/install/index.php en respectant la chronologie indiqu&eacute;e :</p>
<blockquote>
  <p class="Style1"> a) Cr&eacute;ation automatis&eacute;e des tables</p>
  <p class="Style1"> b) Saisie des enseignants d&eacute;sirant utiliser l&rsquo;application - (la cr&eacute;ation du nom Administrateur et de son mot de passe permettra &agrave; l&rsquo;administrateur d&rsquo;acc&eacute;der rapidement &agrave; son interface)</p>
  <p class="Style1"> c) Saisie des classes (uniquement celles ou interviennent le ou les enseignants)</p>
  <p class="Style1"> d) Saisie des mati&egrave;res (uniquement celles ou interviennent le ou les enseignants)</p>
</blockquote>
<p class="Style1"> Une version sp&eacute;cifique SambaEdu pour annuaire LDAP est &eacute;galement propos&eacute;e en t&eacute;l&eacute;chargement.</p>
<p class="Style1"> L&rsquo;application est optimis&eacute;e pour un affichage 1024 x 768. En developpement, l&rsquo;&eacute;criture en Latex pour les scientifiques, l&rsquo;import des enseignants depuis Sconet.</p>
<p class="Style9">Enseignant - Utilisation</p>
<p class="Style1"><a href="http://www.etab.ac-caen.fr/bsauveur/cahier_de_texte/aide/aide.htm">Consultez cette petite animation... </a></p>
<p class="Style1">L&rsquo;enseignant s&rsquo;identifie avec le mot de passe fourni par l&rsquo;administrateur.</p>
<p class="Style1">Il saisit son emploi du temps en compl&eacute;tant le formulaire. (Le plus fastidieux - Il faut compter environ 8 minutes pour saisir 18 heures de cours, mais quel gain de temps par la suite)</p>
<p class="Style1">L&rsquo;emploi du temps permet de pr&eacute;ciser au choix : Classe enti&egrave;re - Groupe A - Groupe B - Autres</p>
<p class="Style1">Il permet &eacute;galement de pr&eacute;ciser : Semaine A - Semaine B - Indiff&eacute;rent</p>
<p class="Style1">L&rsquo;enseignant peut ensuite d&eacute;buter le remplissage de son cahier de textes</p>
<p class="Style1"> * Cliquer sur la date voulue sur le calendrier. ( par exemple Lundi 5 Septembre)</p>
<p class="Style1"> * Les cours du Lundi s&rsquo;affichent. Cliquer sur l&rsquo;heure de cours.</p>
<p class="Style1"> * Un formulaire s&rsquo;affiche pour la saisie.<br />
  * Les cours ant&eacute;rieurs apparaissent &eacute;galement. Possibilit&eacute; de Couper Coller entre des groupes ayant des cours identiques.<br />
  * Il est possible en remplissant le formulaire de joindre des fichiers ( Exercices, Devoirs, ou tout fichier ayant &eacute;t&eacute; utilis&eacute; pendant le cours)</p>
<p class="Style1">L&rsquo;enseignant &agrave; la possibilit&eacute; de remplir son cahier de textes sans le publier en ligne (phase de test).</p>
<p class="Style1">Pour faciliter le remplissage, il peut enregistrer sur le serveur ses fiches de progression annuelles et proc&eacute;der ainsi par copier/coller. Il peut consulter, si l&rsquo;administrateur l&rsquo;a param&eacute;tr&eacute;, le cahier de l&rsquo;ann&eacute;e pr&eacute;c&eacute;dente.</p>
<p class="Style9">Tester en ligne - <a href="http://www.etab.ac-caen.fr/bsauveur/cahier_de_texte/?page_id=33">Voir le site de d&eacute;monstration</a> </p>
<p class="Style1">Choisir l&rsquo;enseignant Lemaitre dont le mot de passe est &ldquo;passe&rdquo; . Consultez son emploi du temps mais ne le modifiez pas SVP. Vous pouvez cependant remplir le cahier de textes en Sc Physiques pour votre test.</p>
<p class="Style1">Un &eacute;diteur (Xinha) est incorpor&eacute; pour la mise en forme de votre saisie (Voir Term Pro C - Sc. Physiques)</p>
<p class="Style9">El&egrave;ve - Consultation</p>
<p class="Style1">L&rsquo;&eacute;l&egrave;ve choisit sa classe sur la page d&rsquo;accueil - saisit &eacute;ventuellement un mot de passe (choix de l&rsquo;&eacute;tablissement), visualise le travail &agrave; faire et l&rsquo;ensemble du cahier de textes de sa classe, de son groupe, et les informations issues de la vie scolaire. Il dispose des fichiers mis en pi&egrave;ces jointes par ses enseignants. </p>
<p class="Style1">Il dispose d'un fil RSS pour recevoir en temps r&eacute;el son travail &agrave; faire. </p>
<p class="Style9">&nbsp;</p>
<p class="Style9">Le responsable &eacute;tablissement</p>
<p class="Style1">Le responsable &eacute;tablissement consulte les cahiers et appose un visa sur l&rsquo;ensemble des cahiers ou de mani&egrave;re individuelle. Un &eacute;tat lui permet de connaitre les dates de derni&egrave;res mises &agrave; jour, le nom des enseignants publiant en ligne. Il peut &eacute;galement r&eacute;aliser une sauvegarde.</p>
<p class="Style9">&nbsp;</p>
<p class="Style9">Le module vie scolaire</p>
<p class="Style1">Ce module permet de diffuser des informations via les cahiers de textes de mani&egrave;re collective ou individuelle.</p>
<p class="Style1">&nbsp;</p>
<p class="Style9">Ce qu'ils en pensent </p>
<p class="Style1"><a href="http://www.framasoft.net/article4665.html">Un extrait de Framasoft </a></p>
<p class="Style1">&nbsp;</p>
<p class="Style9">Licence</p>
<p class="Style1">Cette application rel&egrave;ve du domaine du logiciel libre - Option Chocolaware. <a href="http://www.etab.ac-caen.fr/bsauveur/cahier_de_texte/?page_id=6">Consultez la rubrique Licence</a> </p>
<p class="Style1"><strong>En conclusion,</strong> voici une application tr&egrave;s riche et tr&egrave;s ouverte dans ses param&eacute;trages collant de tr&egrave;s pr&egrave;s &agrave; la r&eacute;alit&eacute; du terrain. Elle est aujourd&rsquo;hui pl&eacute;biscit&eacute;e par de nombreux &eacute;tablissements. Le compteur de t&eacute;l&eacute;chargements en t&eacute;moigne. En perp&eacute;tuel d&eacute;veloppement, des mises &agrave; jours r&eacute;guli&egrave;res vous sont propos&eacute;es.</p>
<p class="Style1">Bonne utilisation &agrave; tous</p>
<p class="Style2"><span class="Style3">Pierre LEMAITRE</span><br />
</p>
</body>
</html>
